// Validation errors messages for Parsley
import Parsley from '../parsley';

Parsley.addMessages('mk', {
  defaultMessage: "Оваа вредност се чини дека е неважечка.",
  type: {
    email:        "Оваа вредност треба да е важечка е-пошта.",
    url:          "Оваа вредност треба да е важечки урл.",
    number:       "Оваа вредност треба да е важечки број.",
    integer:      "Оваа вредност треба да е важечки цел број.",
    digits:       "Оваа вредност треба да е цифри.",
    alphanum:     "Оваа вредност треба да е алфанумеричка"
  },
  notblank:       "Оваа вредност не треба да е празна.",
  required:       "Оваа вредност е потребна.",
  pattern:        "Оваа вредност се чини дека е неважечка.",
  min:            "Оваа вредност треба да е поголема од или еднаква на %s.",
  max:            "Оваа вредност треба да е помала од или еднаква на %s.",
  range:          "Оваа вредност треба да е помеѓу %s и %s.",
  minlength:      "Оваа вредност е прекратка. Треба да има %s знаци или повеќе.",
  maxlength:      "Оваа вредност е предолга. Треба да има %s знаци или помалку.",
  length:         "Должината на оваа вредност е неважечка. Треба да биде долга помеѓу %s и %s знаци.",
  mincheck:       "Мора да изберете најмалку %s опции.",
  maxcheck:       "Мора да изберете %s опции или помалку.",
  check:          "Мора да изберете помеѓу %s и %s опции.",
  equalto:        "Оваа вредност треба да биде иста."
});

Parsley.setLocale('mk');
