window.ParsleyConfig = window.ParsleyConfig || {};

(function ($) {
  window.ParsleyConfig = $.extend( true, {}, window.ParsleyConfig, {
    messages: {
      // parsley //////////////////////////////////////
        defaultMessage: "Невалидна стойност."
        , type: {
            email:      "Невалиден имейл адрес."
          , url:        "Невалиден URL адрес."
          , urlstrict:  "Невалиден URL адрес."
          , number:     "Невалиден номер."
          , digits:     "Невалидни цифри."
          , dateIso:    "Невалидна дата (ГГГГ-ММ-ДД)."
          , alphanum:   "Стойността трябва да садържа само букви или цифри."
          , phone:      "Невалиден телефонен номер."
        }
      , notnull:        "Полето е задължително."
      , notblank:       "Полето е задължително."
      , required:       "Полето е задължително."
      , regexp:         "Невалидна стойност."
      , min:            "Стойността трябва да бъде по-голяма или равна на %s."
      , max:            "Стойността трябва да бъде по-малка или равна на %s."
      , range:          "Стойността трябва да бъде между %s и %s."
      , minlength:      "Стойността е прекалено кратка. Мин. дължина: %s символа."
      , maxlength:      "Стойността е прекалено дълга. Макс. дължина: %s символа."
      , rangelength:    "Дължината на стойността трябва да бъде между %s и %s символа."
      , mincheck:       "Трябва да изберете поне %s стойности."
      , maxcheck:       "Трябва да изберете най-много %s стойности."
      , rangecheck:     "Трябва да изберете между %s и %s стойности."
      , equalto:        "Стойността трябва да съвпада."

      // parsley.extend ///////////////////////////////
      , minwords:       "Стойността трябва да съдържа поне %s букви."
      , maxwords:       "Стойността трява да съдържа най-много %s букви."
      , rangewords:     "Стойността трябва да съдържа между %s и %s букви."
      , greaterthan:    "Стойността трябва да бъде по-голяма от %s."
      , lessthan:       "Стойността трябва да бъде по-малка от %s."
      , beforedate:     "Датата трябва да бъде преди %s."
      , afterdate:      "Дата трябва да бъде след %s."
      , americandate:	"Невалиден формат на датата (ММ/ДД/ГГГГ)."
    }
  });
}(window.jQuery || window.Zepto));
