window.ParsleyConfig = window.ParsleyConfig || {};

(function ($) {
  window.ParsleyConfig = $.extend( true, {}, window.ParsleyConfig, {
    messages: {
      // parsley //////////////////////////////////////
        defaultMessage: "Поле заповнене некорректно."
      , type: {
            email:      "Поле повинно бути адресою електронної пошти."
          , url:        "Поле повинно бути посиланням на сайт."
          , urlstrict:  "Поле повинно бути посиланням на сайт."
          , number:     "Поле повинно бути числом."
          , digits:     "Поле повинно містити тільки цифри."
          , dateIso:    "Поле повинно бути датою у форматі (РРРР-ММ-ДД)."
          , alphanum:   "Поле повинно містити тільки цифри і літери."
        }
      , notnull:        "Поле повинно бути не нульовим."
      , notblank:       "Поле не повинно бути порожнім."
      , required:       "Поле обов'язкове для заповнення."
      , regexp:         "Поле заповнено некорректно."
      , min:            "Значення поля повинно бути більше, ніж %s."
      , max:            "Значення поля повинно бути меньше, ніж %s."
      , range:          "Значення поля повинно бути між %s та %s."
      , minlength:      "Довжина поля повинна бути щонайменьше %s символів(а)."
      , maxlength:      "Довжина поля повинна бути щонайбільше %s символів(а)."
      , rangelength:    "Довжина поля повинна бути від %s і до %s символів(а)."
      , mincheck:       "Необхідно вибрати неменьше, ніж %s пункт(ів)."
      , maxcheck:       "Необхідно вибрати небільше, ніж %s пункт(ів)."
      , rangecheck:     "Необхідно вибрати від %s і до %s пунктів."
      , equalto:        "Значення полів повинно бути однаковим."

      // parsley.extend ///////////////////////////////
    }
  });
}(window.jQuery || window.Zepto));
