window.ParsleyConfig = window.ParsleyConfig || {};

(function ($) {
  window.ParsleyConfig = $.extend( true, {}, window.ParsleyConfig, {
    messages: {
      // parsley //////////////////////////////////////
        defaultMessage: "Алдаатай утга оруулсан байна."
        , type: {
            email:      "Зөв и-мэйл хаяг оруулна уу."
          , url:        "Зөв холбоос оруулна уу."
          , urlstrict:  "Зөв холбоос оруулна уу."
          , number:     "Тоо оруулна уу."
          , digits:     "Зөвхөн тоо оруулна уу."
          , dateIso:    "Зөв огноо оруулна уу (ОООО-СС-ӨӨ)."
          , alphanum:   "Тоо болон үсэг оруулна уу."
          , phone:      "Зөв утасны дугаар оруулна уу."
        }
      , notnull:        "Энэ талбарыг хоосон орхих боломжгүй."
      , notblank:       "Энэ талбарыг хоосон орхих боломжгүй."
      , required:       "Энэ талбарыг бөглөнө үү."
      , regexp:         "Алдаатай утга оруулсан байна."
      , min:            "%s - с их утга оруулна уу."
      , max:            "%s - с бага утга оруулна уу."
      , range:          "%s - %s хооронд утга оруулна уу."
      , minlength:      "Хэт богино утга оруулсан байна. %s эсвэл түүнээс их тэмдэгт оруулна уу."
      , maxlength:      "Хэт урт утга оруулсан байна. %s эсвэл түүнээс бага тэмдэгт оруулна уу."
      , rangelength:    "Алдаатай утга оруулсан байна. %s - %s хооронд тэмдэгт оруулна."
      , mincheck:       "Хамгийн багадаа %s - г сонгоно уу."
      , maxcheck:       "Та хамгийн ихдээ %s - г сонгох боломжтой."
      , rangecheck:     "Та %s - %s хооронд сонголт хийх боломжтой."
      , equalto:        "Ижил утга оруулна уу."

      // parsley.extend ///////////////////////////////
      , minwords:       "Хамгийн багадаа %s үг оруулна уу."
      , maxwords:       "Хамгийн ихдээ %s үг оруулна уу."
      , rangewords:     "%s - %s хооронд үг оруулна уу."
      , greaterthan:    "%s - с их утга оруулна уу."
      , lessthan:       "%s - с бага утга оруулна уу."
      , beforedate:     "%s - с өмнөх огноо оруулна уу."
      , afterdate:      "%s - с дараах огноо оруулна уу."
    }
  });
}(window.jQuery || window.Zepto));
