window.ParsleyConfig = window.ParsleyConfig || {};

(function ($) {
  window.ParsleyConfig = $.extend( true, {}, window.ParsleyConfig, {
    messages: {
      // parsley //////////////////////////////////////
        defaultMessage: "ค่านี้ดูเหมือนว่าจะไม่ถูกต้อง"
        , type: {
            email:      "ค่านี้ควรจะเป็นอีเมลที่ถูกต้อง"
          , url:        "ค่านี้ควรจะเป็น url ที่ถูกต้อง"
          , urlstrict:  "ค่านี้ควรจะเป็น url ที่ถูกต้อง"
          , number:     "ค่านี้ควรจะเป็นตัวเลขที่ถูกต้อง"
          , digits:     "ค่านี้ควรจะเป็นเลขโดด"
          , dateIso:    "ค่านี้ควรจะเป็นวันที่ที่ถูกต้อง (YYYY-MM-DD)"
          , alphanum:   "ค่านี้ควรจะเป็นตัวอักษรเลข"
          , phone:      "ค่านี้ควรจะเป็นหมายเลขโทรศัพท์ที่ถูกต้อง"
        }
      , notnull:        "ค่านี้ไม่ควรจะไม่มีค่า"
      , notblank:       "ค่านี้ไม่ควรจะว่าง"
      , required:       "ค่านี้จำเป็น"
      , regexp:         "ค่านี้ดูเหมือนว่าจะไม่ถูกต้อง"
      , min:            "ค่านี้ควรจะมากกว่าหรือเท่ากับ %s"
      , max:            "ค่านี้ควรจะน้อยกว่าหรือเท่ากับ %s"
      , range:          "ค่านี้ควรอยู่ระหว่าง %s และ %s"
      , minlength:      "ค่านี้สั้นเกินไป, ควรมี %s อักขระหรือมากกว่า"
      , maxlength:      "ค่านี้ยาวเกินไป, ควรมี %s อักขระหรือน้อยกว่า"
      , rangelength:    "ความยาวของค่านี้ไม่ถูกต้อง, ควรมีความยาวอักขระระหว่าง %s และ %s"
      , mincheck:       "คุณจะต้องเลือกอย่างน้อย %s ตัวเลือก"
      , maxcheck:       "คุณจะต้องเลือก %s ตัวเลือกหรือน้อยกว่า"
      , rangecheck:     "คุณจะต้องเลือกระหว่าง %s และ %s ตัวเลือก"
      , equalto:        "ค่านี้ควรจะมีค่าเหมือนกัน"

      // parsley.extend ///////////////////////////////
      , minwords:       "ค่านี้ควรมีจำนวนคำอย่างน้อย %s คำ"
      , maxwords:       "่คานี้ควรมีจำนวนคำไม่เกิน %s คำ"
      , rangewords:     "ค่านี้ควรอยู่ระหว่าง %s และ %s คำ"
      , greaterthan:    "ค่านี้ควรมากกว่า %s"
      , lessthan:       "ค่านี้ควรน้อยกว่า %s"
      , beforedate:     "วันที่นี้ควรก่อน %s"
      , afterdate:      "วันที่นี้ควรหลัง %s"
      , americandate:	"ค่านี้ควรเป็นวันที่ที่ถูกต้อง (MM/DD/YYYY)"
    }
  });
}(window.jQuery || window.Zepto));
