// Validation errors messages for Parsley TAMIL language Translated by pitchaimuthu2050 AT GAMAIL DOT COM
// This translation is part of the Project https://thanithamizhakarathikalanjiyam.github.io/
// Load this after Parsley

Parsley.addMessages('ta', {
  defaultMessage: "இந்த மதிப்பு தவறானது எனத் தெரிகிறது.",
  type: {
    email:        "இந்த மதிப்பு சரியான மின்னஞ்சலாக இருக்க வேண்டும்.",
    url:          "இந்த மதிப்பு சரியான URL ஆக இருக்க வேண்டும்.",
    number:       "இந்த மதிப்பு சரியான எண்ணாக இருக்க வேண்டும்.",
    integer:      "இந்த மதிப்பு சரியான முழு எண்ணாக இருக்க வேண்டும்.",
    digits:       "இந்த மதிப்பு இலக்கங்களாக இருக்க வேண்டும்.",
    alphanum:     "இந்த மதிப்பு எண்ணெழுதாக இருக்க வேண்டும்."
  },
  notblank:       "இந்த மதிப்பு காலியாக இருக்கக்கூடாது.",
  required:       "இந்த மதிப்பு தேவை.",
  pattern:        "இந்த மதிப்பு தவறானது என்று தெரிகிறது.",
  min:            "இந்த மதிப்பு அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும் %s.",
  max:            "இந்த மதிப்பு குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும் %s.",
  range:          "இந்த மதிப்பு %s முதல் %s வரை இருக்க வேண்டும்.",
  minlength:      "இந்த மதிப்பு மிகக் குறைவு. இது %s எழுத்துக்கள் அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும்.",
  maxlength:      "இந்த மதிப்பு மிக நீளமானது. இது %s எழுத்துக்கள் அல்லது குறைவாக இருக்க வேண்டும்.",
  length:         "இந்த மதிப்பு நீளம் தவறானது. இது %s மற்றும் %s எழுத்துக்களுக்கு இடையில் இருக்க வேண்டும்.",
  mincheck:       "நீங்கள் குறைந்தது %s தேர்வுகளை தேர்ந்தெடுக்க வேண்டும்.",
  maxcheck:       "நீங்கள் %s தேர்வுகள் அல்லது குறைவாக தேர்ந்தெடுக்க வேண்டும்.",
  check:          "நீங்கள் %s மற்றும் %s தேர்வுகளுக்கு இடையே தேர்ந்தெடுக்க வேண்டும்.",
  equalto:        "இந்த மதிப்பு ஒரே மாதிரியாக இருக்க வேண்டும்.",
  euvatin:        "இது சரியான VAT அடையாள எண் அல்ல.",
});

Parsley.setLocale('ta');
