// Validation errors messages for Parsley
// Load this after Parsley

Parsley.addMessages('th', {
  dateiso:  "วันที่ต้องมีรูปแบบเป็น YYYY-MM-DD",
  date:     "วันที่ไม่ถูกต้องตามรูปแบบ %s",
  datebeforenow: "วันที่ต้องมีรูปแบบเป็น %s และเป็นวันที่ก่อนวันปัจจุบัน",
  dateafternow: "วันที่ต้องมีรูปแบบเป็น %s และเป็นวันที่หลังวันปัจจุบัน",
  minwords: "กรุณากรอกอย่างน้อย %s คำ",
  maxwords: "กรอกได้ไม่เกิน %s คำ",
  words:    "จำนวนคำต้องอยู่ระหว่าง %s ถึง %s คำ",
  gt:       "กรุณากรอกค่าที่มากกว่า %s",
  gte:      "กรุณากรอกค่าที่มากกว่าหรือเท่ากับ %s",
  lt:       "กรุณากรอกค่าที่น้อยกว่า %s",
  lte:      "กรุณากรอกค่าที่น้อยกว่าหรือเท่ากับ %s",
  notequalto: "ค่าที่กรอกต้องเหมือนกับ %s"
});
